In [1]:
import numpy as np
import pandas as pd

In [2]:
# infra = pd.read_csv('qwe.txt', delimiter='\t', names=['n_ondas','transm'])

In [3]:
np = {'NAME':['Su','Tha','Yan','Han','Zhan'], 'AGE':[12,45,23,35,30],'HEIGHT':[1.80,1.85,1.56,1.75,1.79]}

In [4]:
np

{'NAME': ['Su', 'Tha', 'Yan', 'Han', 'Zhan'],
 'AGE': [12, 45, 23, 35, 30],
 'HEIGHT': [1.8, 1.85, 1.56, 1.75, 1.79]}

In [5]:
df = pd.DataFrame(np,index=['nome1','nome2','nome3','nome4','nome5'], columns =['height1','height2','height3'])

In [6]:
df

      height1 height2 height3
nome1     NaN     NaN     NaN
nome2     NaN     NaN     NaN
nome3     NaN     NaN     NaN
nome4     NaN     NaN     NaN
nome5     NaN     NaN     NaN

In [7]:
df['height1']

nome1    NaN
nome2    NaN
nome3    NaN
nome4    NaN
nome5    NaN
Name: height1, dtype: object

In [10]:
np = {'NAME':['Su','Tha','Yan','Han','Zhan'], 'AGE':[12,45,23,35,30],'HEIGHT':[1.80,1.85,1.56,1.75,1.79]}

In [11]:
np

{'NAME': ['Su', 'Tha', 'Yan', 'Han', 'Zhan'],
 'AGE': [12, 45, 23, 35, 30],
 'HEIGHT': [1.8, 1.85, 1.56, 1.75, 1.79]}

In [8]:
df = pd.DataFrame(np,index=['nome1','nome2','nome3','nome4','nome5'], columns =['NAME','AGE','HEIGHT'])

In [9]:
df

       NAME  AGE  HEIGHT
nome1    Su   12    1.80
nome2   Tha   45    1.85
nome3   Yan   23    1.56
nome4   Han   35    1.75
nome5  Zhan   30    1.79

In [10]:
df['NAME']

nome1      Su
nome2     Tha
nome3     Yan
nome4     Han
nome5    Zhan
Name: NAME, dtype: object

In [ ]:
# DIFFERENCES BETWEEN SERIES AND DATAFRAME

In [14]:
df['NAME'].append(pd.Series('oi'))

nome1      Su
nome2     Tha
nome3     Yan
nome4     Han
nome5    Zhan
0          oi
dtype: object

In [14]:
df.head(2)

      NAME  AGE  HEIGHT
nome1   Su   12    1.80
nome2  Tha   45    1.85

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, nome1 to nome5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   NAME    5 non-null      object
 1   AGE     5 non-null      int64
 2   HEIGHT  5 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 160.0+ bytes

In [35]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
infra['transm'].dtype

In [ ]:
df.dtype()

---------------------------------------------------------------------------
AttributeError                            Traceback (most recent call last)
<ipython-input-39-144c7b0decef> in <module>
----> 1 df.dtype()

~\anaconda3\lib\site-packages\pandas\core\generic.py in __getattr__(self, name)
   5272             if self._info_axis._can_hold_identifiers_and_holds_name(name):
   5273                 return self[name]
-> 5274             return object.__getattribute__(self, name)
   5275 
   5276     def __setattr__(self, name: str, value) -> None:

AttributeError: 'DataFrame' object has no attribute 'dtype'

In [69]:
print(df.shape)

(5, 3)

In [41]:
df['AGE'].mean()

29.0

In [42]:
df['AGE'].max()

45

In [43]:
df['AGE'].min()

12

In [44]:
df['AGE']

nome1    12
nome2    45
nome3    23
nome4    35
nome5    30
Name: AGE, dtype: int64

In [45]:
df['AGE'] == 12

nome1     True
nome2    False
nome3    False
nome4    False
nome5    False
Name: AGE, dtype: bool

In [46]:
df[df['AGE'] == 12]

      NAME  AGE  HEIGHT
nome1   Su   12     1.8

In [47]:
df[df['AGE'] == 12] ['NAME']

nome1    Su
Name: NAME, dtype: object

In [48]:
df['AGE'] == df['AGE'].max()

nome1    False
nome2     True
nome3    False
nome4    False
nome5    False
Name: AGE, dtype: bool

In [49]:
df[df['AGE'] == df['AGE'].max()]

      NAME  AGE  HEIGHT
nome2  Tha   45    1.85

In [58]:
df[df['AGE'] == df['AGE'].min()]

      NAME  AGE  HEIGHT
nome1   Su   12     1.8

In [50]:
df[df['AGE'] == df['AGE'].max()]['NAME']

nome2    Tha
Name: NAME, dtype: object

In [52]:
df.loc[df['AGE'].idxmax()]

NAME       Tha
AGE         45
HEIGHT    1.85
Name: nome2, dtype: object

In [53]:
df['AGE'].idxmax()

'nome2'

In [57]:
df['AGE'].argmin()

0

In [55]:
df.iloc[df['AGE'].argmax()]

NAME       Tha
AGE         45
HEIGHT    1.85
Name: nome2, dtype: object

In [56]:
df.iloc[df['AGE'].argmin()]

NAME       Su
AGE        12
HEIGHT    1.8
Name: nome1, dtype: object

In [54]:
df['AGE'].idxmax()

'nome2'

In [59]:
df.groupby('HEIGHT').mean()

        AGE
HEIGHT
1.56     23
1.75     35
1.79     30
1.80     12
1.85     45

In [61]:
df.groupby('HEIGHT').mean()['AGE']

HEIGHT
1.56    23
1.75    35
1.79    30
1.80    12
1.85    45
Name: AGE, dtype: int64

In [62]:
df['HEIGHT'].unique()

array([1.8 , 1.85, 1.56, 1.75, 1.79])

In [63]:
df['HEIGHT'].nunique()

5

In [64]:
df['HEIGHT'].value_counts().head(3)

1.56    1
1.85    1
1.80    1
Name: HEIGHT, dtype: int64

In [ ]:
#sal[sal['Year']==2013]['JobTitle'].value_counts()
#sum(sal[sal['Year']==2013]['JobTitle'].value_counts() == 1)

In [66]:
df

       NAME  AGE  HEIGHT
nome1    Su   12    1.80
nome2   Tha   45    1.85
nome3   Yan   23    1.56
nome4   Han   35    1.75
nome5  Zhan   30    1.79

In [65]:
df['AGE']

nome1    12
nome2    45
nome3    23
nome4    35
nome5    30
Name: AGE, dtype: int64

In [67]:
df[df['AGE'] > 23]

       NAME  AGE  HEIGHT
nome2   Tha   45    1.85
nome4   Han   35    1.75
nome5  Zhan   30    1.79

In [68]:
df[df['AGE'] > 23].count()

NAME      3
AGE       3
HEIGHT    3
dtype: int64

In [70]:
df['AGE'].tolist()

[12, 45, 23, 35, 30]

In [71]:
df['AGE'].to_numpy()

array([12, 45, 23, 35, 30], dtype=int64)

In [72]:
df.filter(['AGE'])

       AGE
nome1   12
nome2   45
nome3   23
nome4   35
nome5   30

In [16]:
df

       NAME  AGE  HEIGHT
nome1    Su   12    1.80
nome2   Tha   45    1.85
nome3   Yan   23    1.56
nome4   Han   35    1.75
nome5  Zhan   30    1.79

In [17]:
def name(title):
    if 'pop' in title.lower().split():
        return True
    else:
        return False

In [18]:
print(name)

<function name at 0x00000226BD1AD288>

In [ ]:
dataList = bad['residual sugar']
for row in df.itertuples(): 
    mylist = [row.cluster, row.load_date, row.budget, row.actual, row.fixed_price]
    dataList.append(mylist)

In [ ]:
dataList = [] #empty list
for row in df.itertuples(): 
    mylist = [row.cluster, row.load_date, row.budget, row.actual, row.fixed_price]
    dataList.append(mylist)

In [6]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [11]:
pd.Series()

Series([], dtype: float64)

In [12]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [14]:
pd.Series(data = my_data,index=labels) #pd.Series(data = my_data,labels)

a    10
b    20
c    30
dtype: int64

In [15]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [16]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [17]:
d

{'a': 10, 'b': 20, 'c': 30}

In [18]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [20]:
series1 = pd.Series([1,2,3,4],['usa','german','ussr','japan'])

In [21]:
series1

usa       1
german    2
ussr      3
japan     4
dtype: int64

In [24]:
a = {1:'usa',2:'german',3:'ussr',4:'japan'}

In [25]:
pd.Series2(a) ?????

AttributeError: module 'pandas' has no attribute 'Series2'

In [26]:
ser1 = pd.Series([1,2,3,4],['usa','german','ussr','japan'])

In [27]:
ser2 = pd.Series([1,2,3,4],['usa','german','italy','japan'])

In [28]:
ser3 = pd.Series(data=labels)

In [29]:
ser3

0    a
1    b
2    c
dtype: object

In [30]:
ser1 + ser2

german    4.0
italy     NaN
japan     8.0
usa       2.0
ussr      NaN
dtype: float64